/* ====== ЭНД ӨӨРИЙНХӨӨРӨӨ ӨӨРЧИЛ ====== */
export type DateType = {
  k: string;
  e: string;
  l: string;
  title: string;
};

export const CONFIG = {
  withText: "Чаппи-тай хамт", // баталгааны хуудсан дээр гарах
  fromName: "Чаппи", // хариу илгээх мессеж дээр
  // "Замдаа юу хийх вэ?" хуудсан дээрх сонголтууд
  types: [
    { k: "coffee", e: "☕", l: "кофе", title: "Кофе болзоо" },
    { k: "movie", e: "🎬", l: "кино", title: "Кино болзоо" },
    { k: "food", e: "🍝", l: "хоол", title: "Оройн зоог" },
    { k: "walk", e: "🌷", l: "алхалт", title: "Алхалт" },
    { k: "traffic", e: "🚗", l: "ярилцлага", title: "Түгжрэл дундах ярилцлага" },
    { k: "surprise", e: "🎁", l: "сюрприз", title: "Сюрприз болзоо" },
  ] as DateType[],
  // "Ямар болзоо вэ?" хэсэгт гарах болзоо
  dateTitle: "Арцат апартмент руу явах 3 цагийн болзоо",
  // Уулзах газар
  place: "Арцат апартмент",
  maps: "Artsat apartment Ulaanbaatar",
  // Хаягийн доор сонгох хувилбарууд
  rides: ["🚗 Намайг ирж аваарай", "🚶 Өөрөө очно"],
  onlyTime: "20:30", // зөвхөн энэ цагийг сонгож болно
  durationHours: 3,
  idleMinutes: 5, // ийм удаан юу ч хийгээгүй бол эхний дугтуй руу буцна
};
/* ===================================== */
